gcc -g p2original.c
 ./a.out
enter any number:
33
enter any number:
22
enter any number:
88
88 is the largest of them all
 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x82c: file p2original.c, line 42.
(gdb) r
Starting program: /home/runner/pps-IA1-practice/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p2original.c:42
42    a=input();
 
 gcc -g p2original.c
 ./a.out
enter any number:
44
enter any number:
33
enter any number:
22
44 is the largest of them all
 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x82c: file p2original.c, line 42.
(gdb) r
Starting program: /home/runner/pps-IA1-practice/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p2original.c:42
42    a=input();
(gdb) n
enter any number:
88
43    b=input();
(gdb) n
enter any number:
44
44    c=input();
(gdb) n
enter any number:
22
45    largest=cmp(a,b,c);
(gdb) s
cmp (a=88, b=44, c=22) at p2original.c:4
4     if (a>b)
(gdb) n
6       if (a>c)
(gdb) n
8         return a;
(gdb) n
26  }
(gdb) n
main () at p2original.c:46
46    output(a,b,c,largest);
(gdb) p a
$1 = 88
(gdb) p b
$2 = 44
(gdb) p c
$3 = 22
(gdb) n
88 is the largest of them all
48    return 0; 
(gdb) q
A debugging session is active.

    Inferior 1 [process 550] will be killed.

Quit anyway? (y or n) y
 